In [118]:
!pip install pandas numpy category_encoders

Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.3.2)
Requirement already satisfied: numpy in ./.venv/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: category_encoders in ./.venv/lib/python3.13/site-packages (2.8.1)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: patsy>=0.5.1 in ./.venv/lib/python3.13/site-packages (from category_encoders) (1.0.1)
Requirement already satisfied: scikit-learn>=1.6.0 in ./.venv/lib/python3.13/site-packages (from category_encoders) (1.7.2)
Requirement already satisfied: scipy>=1.0.0 in ./.venv/lib/python3.13/site-packages (from category_encoders) (1.16.2)
Requirement already satisfied: statsmodels>=0.9.0 in ./.venv/lib/python3.13/site-packages (from category_encoders) (0.14.5)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: joblib>=1.2.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn>=1.6.0->category_encoders) (1.5.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn>=1.6.0->category_encoders) (3.6.0)
Requirement already satisfied: packaging>=21.3 in ./.venv/lib/python3.13/site-packages (from statsmodels>=0.9.0->category_encoders) (25.0)

In [119]:
#from google.colab import drive
#drive.mount('/content/drive')

# Importando bibliotecas

In [120]:
import pandas as pd

In [121]:
df_cliente1 = pd.read_csv('https://raw.githubusercontent.com/gabrielranulfo/univel_aula03_kdd/refs/heads/master/data/clientes.csv')
df_cliente2 = pd.read_csv('https://raw.githubusercontent.com/gabrielranulfo/univel_aula03_kdd/refs/heads/master/data/clientes%202.csv')

# Análise Exploratória de Dados (AED)

In [122]:
df_cliente1

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
1,1.111111e+10,Maria,F,07-10-85,S,5.0,3000.0,2000.0,P,Urca,A
2,3.333333e+10,Ana,F,08-15-81,S,4.0,5000.0,3000.0,P,Leblon,A
3,5.555556e+10,Pedro,M,09-10-75,C,3.0,1500.0,1500.0,A,Centro,A
4,2.222222e+10,Mario,M,02-20-60,C,5.0,2500.0,1500.0,P,Leblon,A
5,0.000000e+00,Manoel,M,10-13-54,S,1.0,NaN,1000.0,E,Barra,I
6,8.888889e+10,Liza,F,04-27-80,S,2.0,4500.0,3000.0,F,Urca,A
7,7.777778e+10,Marisa,F,07-14-80,C,3.0,1000.0,500.0,A,Recreio,I
8,6.666667e+10,Carlos,M,11-06-63,V,7.0,4300.0,4000.0,F,Leblon,A
9,4.444444e+10,Paula,F,12-15-82,C,3.0,1400.0,1000.0,A,Centro,I
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [123]:
df_cliente2

,CPF,nome,S,nascimento,relacionamento,depent,salario,gastos,residencia,bairo,resultado
0,3.521488e+10,Ana,F,03-12-90,S,2.0,3500.0,1500.0,P,Barra da Tijuca,A
1,8.754124e+10,Pedro,M,07-25-85,C,1.0,2800.0,1000.0,A,Copacabana,A
2,9.632587e+10,Maria,F,11-08-78,C,4.0,5000.0,3000.0,F,Ipanema,A
3,1.234568e+10,João,M,02-19-95,S,0.0,1800.0,800.0,P,Tijuca,I
4,4.567891e+10,Carla,F,05-30-82,V,3.0,4200.0,2500.0,P,Botafogo,A
...,...,...,...,...,...,...,...,...,...,...,...
282,1.878901e+10,Laura,F,04-17-80,S,1.0,2000.0,900.0,X,Grajaú,I
283,1.889012e+10,Gustavo,M,08-21-90,C,3.0,4500.0,2500.0,F,Andaraí,A
284,1.890123e+10,Fernanda,F,06-03-75,V,4.0,5000.0,3000.0,P,Centro,A
285,1.901235e+10,Thiago,M,01-18-88,C,1.0,2800.0,1200.0,A,Leblon,A
286,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [124]:
df_cliente2.shape

(287, 11)

In [125]:
linhas, colunas = df_cliente2.shape

In [126]:
linhas

287

In [127]:
colunas

11

In [128]:
df_cliente2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 287 entries, 0 to 286
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CPF             286 non-null    float64
 1   nome            286 non-null    object
 2   S               286 non-null    object
 3   nascimento      286 non-null    object
 4   relacionamento  286 non-null    object
 5   depent          270 non-null    float64
 6   salario         286 non-null    float64
 7   gastos          280 non-null    float64
 8   residencia      286 non-null    object
 9   bairo           286 non-null    object
 10  resultado       286 non-null    object
dtypes: float64(4), object(7)
memory usage: 24.8+ KB

In [129]:
df_cliente1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         10 non-null     float64
 1   Nome        10 non-null     object
 2   Sexo        10 non-null     object
 3   Data_Nasc   10 non-null     object
 4   Est_Civil   10 non-null     object
 5   Num_Dep     10 non-null     float64
 6   Renda       8 non-null      float64
 7   Despesa     10 non-null     float64
 8   Tp_Res      10 non-null     object
 9   Bairro_Res  10 non-null     object
 10  Result      10 non-null     object
dtypes: float64(4), object(7)
memory usage: 1.1+ KB

In [130]:
df_cliente2.describe(include='all')

,CPF,nome,S,nascimento,relacionamento,depent,salario,gastos,residencia,bairo,resultado
count,2.860000e+02,286,286,286,286,270.000000,286.000000,280.000000,286,286,286
unique,NaN,59,2,62,3,NaN,NaN,NaN,4,19,2
top,NaN,Gustavo,F,12-29-72,C,NaN,NaN,NaN,P,Leblon,A
freq,NaN,8,146,7,153,NaN,NaN,NaN,92,29,229
mean,4.222694e+10,NaN,NaN,NaN,NaN,2.537037,4052.797203,2329.464286,NaN,NaN,NaN
std,2.875060e+10,NaN,NaN,NaN,NaN,1.745019,1840.950138,1453.076602,NaN,NaN,NaN
min,1.001235e+10,NaN,NaN,NaN,NaN,0.000000,1500.000000,700.000000,NaN,NaN,NaN
25%,1.581429e+10,NaN,NaN,NaN,NaN,1.000000,2500.000000,1100.000000,NaN,NaN,NaN
50%,3.456789e+10,NaN,NaN,NaN,NaN,2.000000,3600.000000,1900.000000,NaN,NaN,NaN
75%,6.789012e+10,NaN,NaN,NaN,NaN,4.000000,5200.000000,3400.000000,NaN,NaN,NaN
max,9.901235e+10,NaN,NaN,NaN,NaN,6.000000,9000.000000,6000.000000,NaN,NaN,NaN

In [131]:
df_cliente2.describe()

                CPF      depent      salario       gastos
count  2.860000e+02  270.000000   286.000000   280.000000
mean   4.222694e+10    2.537037  4052.797203  2329.464286
std    2.875060e+10    1.745019  1840.950138  1453.076602
min    1.001235e+10    0.000000  1500.000000   700.000000
25%    1.581429e+10    1.000000  2500.000000  1100.000000
50%    3.456789e+10    2.000000  3600.000000  1900.000000
75%    6.789012e+10    4.000000  5200.000000  3400.000000
max    9.901235e+10    6.000000  9000.000000  6000.000000

In [132]:
df_cliente1.columns

Index(['Cpf', 'Nome', 'Sexo', 'Data_Nasc', 'Est_Civil', 'Num_Dep', 'Renda',
       'Despesa', 'Tp_Res', 'Bairro_Res', 'Result'],
      dtype='object')

In [133]:
df_cliente2

,CPF,nome,S,nascimento,relacionamento,depent,salario,gastos,residencia,bairo,resultado
0,3.521488e+10,Ana,F,03-12-90,S,2.0,3500.0,1500.0,P,Barra da Tijuca,A
1,8.754124e+10,Pedro,M,07-25-85,C,1.0,2800.0,1000.0,A,Copacabana,A
2,9.632587e+10,Maria,F,11-08-78,C,4.0,5000.0,3000.0,F,Ipanema,A
3,1.234568e+10,João,M,02-19-95,S,0.0,1800.0,800.0,P,Tijuca,I
4,4.567891e+10,Carla,F,05-30-82,V,3.0,4200.0,2500.0,P,Botafogo,A
...,...,...,...,...,...,...,...,...,...,...,...
282,1.878901e+10,Laura,F,04-17-80,S,1.0,2000.0,900.0,X,Grajaú,I
283,1.889012e+10,Gustavo,M,08-21-90,C,3.0,4500.0,2500.0,F,Andaraí,A
284,1.890123e+10,Fernanda,F,06-03-75,V,4.0,5000.0,3000.0,P,Centro,A
285,1.901235e+10,Thiago,M,01-18-88,C,1.0,2800.0,1200.0,A,Leblon,A
286,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [134]:
df_cliente2.columns

Index(['CPF', 'nome', 'S', 'nascimento', 'relacionamento', 'depent', 'salario',
       'gastos', 'residencia', 'bairo', 'resultado'],
      dtype='object')

In [135]:
df_cliente2.isna().sum()

CPF                1
nome               1
S                  1
nascimento         1
relacionamento     1
depent            17
salario            1
gastos             7
residencia         1
bairo              1
resultado          1
dtype: int64

In [136]:
nome_colunas= {
    'CPF': 'Cpf',
    'nome': 'Nome',
    'S': 'Sexo',
    'nascimento': 'Data_Nasc',
    'relacionamento': 'Est_Civil',
    'depent': 'Num_Dep',
    'salario': 'Renda',
    'gastos' : 'Despesa',
    'residencia': 'Tp_Res',
    'bairo': 'Bairro_Res',
    'resultado': 'Result'
}

In [137]:
df_cliente2.rename(columns=nome_colunas, inplace=True)

In [138]:
df_corrigido = pd.concat([df_cliente1, df_cliente2])

In [139]:
df_corrigido.loc[[0]]

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
0,3.521488e+10,Ana,F,03-12-90,S,2.0,3500.0,1500.0,P,Barra da Tijuca,A

In [140]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
1,1.111111e+10,Maria,F,07-10-85,S,5.0,3000.0,2000.0,P,Urca,A
2,3.333333e+10,Ana,F,08-15-81,S,4.0,5000.0,3000.0,P,Leblon,A
3,5.555556e+10,Pedro,M,09-10-75,C,3.0,1500.0,1500.0,A,Centro,A
4,2.222222e+10,Mario,M,02-20-60,C,5.0,2500.0,1500.0,P,Leblon,A
...,...,...,...,...,...,...,...,...,...,...,...
282,1.878901e+10,Laura,F,04-17-80,S,1.0,2000.0,900.0,X,Grajaú,I
283,1.889012e+10,Gustavo,M,08-21-90,C,3.0,4500.0,2500.0,F,Andaraí,A
284,1.890123e+10,Fernanda,F,06-03-75,V,4.0,5000.0,3000.0,P,Centro,A
285,1.901235e+10,Thiago,M,01-18-88,C,1.0,2800.0,1200.0,A,Leblon,A
286,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [141]:
df_corrigido[df_corrigido['Renda'].isnull()]

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
5,0.000000e+00,Manoel,M,10-13-54,S,1.0,NaN,1000.0,E,Barra,I
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
286,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [142]:
df_corrigido.dropna(axis=0, how='all', inplace=True)
df_corrigido.dropna(axis=1, how='all', inplace=True)

In [143]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
1,1.111111e+10,Maria,F,07-10-85,S,5.0,3000.0,2000.0,P,Urca,A
2,3.333333e+10,Ana,F,08-15-81,S,4.0,5000.0,3000.0,P,Leblon,A
3,5.555556e+10,Pedro,M,09-10-75,C,3.0,1500.0,1500.0,A,Centro,A
4,2.222222e+10,Mario,M,02-20-60,C,5.0,2500.0,1500.0,P,Leblon,A
...,...,...,...,...,...,...,...,...,...,...,...
281,1.867890e+10,Bruno,M,12-10-86,C,2.0,3200.0,1400.0,A,Vila Isabel,A
282,1.878901e+10,Laura,F,04-17-80,S,1.0,2000.0,900.0,X,Grajaú,I
283,1.889012e+10,Gustavo,M,08-21-90,C,3.0,4500.0,2500.0,F,Andaraí,A
284,1.890123e+10,Fernanda,F,06-03-75,V,4.0,5000.0,3000.0,P,Centro,A
285,1.901235e+10,Thiago,M,01-18-88,C,1.0,2800.0,1200.0,A,Leblon,A

In [144]:
df_corrigido.reset_index(drop=True, inplace=True)

In [145]:
df_corrigido[df_corrigido['Renda'].isnull()]

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
5,0.000000e+00,Manoel,M,10-13-54,S,1.0,NaN,1000.0,E,Barra,I

In [146]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
1,1.111111e+10,Maria,F,07-10-85,S,5.0,3000.0,2000.0,P,Urca,A
2,3.333333e+10,Ana,F,08-15-81,S,4.0,5000.0,3000.0,P,Leblon,A
3,5.555556e+10,Pedro,M,09-10-75,C,3.0,1500.0,1500.0,A,Centro,A
4,2.222222e+10,Mario,M,02-20-60,C,5.0,2500.0,1500.0,P,Leblon,A
...,...,...,...,...,...,...,...,...,...,...,...
291,1.867890e+10,Bruno,M,12-10-86,C,2.0,3200.0,1400.0,A,Vila Isabel,A
292,1.878901e+10,Laura,F,04-17-80,S,1.0,2000.0,900.0,X,Grajaú,I
293,1.889012e+10,Gustavo,M,08-21-90,C,3.0,4500.0,2500.0,F,Andaraí,A
294,1.890123e+10,Fernanda,F,06-03-75,V,4.0,5000.0,3000.0,P,Centro,A
295,1.901235e+10,Thiago,M,01-18-88,C,1.0,2800.0,1200.0,A,Leblon,A

In [147]:
df_corrigido.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 296 entries, 0 to 295
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         296 non-null    float64
 1   Nome        296 non-null    object
 2   Sexo        296 non-null    object
 3   Data_Nasc   296 non-null    object
 4   Est_Civil   296 non-null    object
 5   Num_Dep     280 non-null    float64
 6   Renda       294 non-null    float64
 7   Despesa     290 non-null    float64
 8   Tp_Res      296 non-null    object
 9   Bairro_Res  296 non-null    object
 10  Result      296 non-null    object
dtypes: float64(4), object(7)
memory usage: 25.6+ KB

In [148]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,NaN,1000.0,X,Centro,A
1,1.111111e+10,Maria,F,07-10-85,S,5.0,3000.0,2000.0,P,Urca,A
2,3.333333e+10,Ana,F,08-15-81,S,4.0,5000.0,3000.0,P,Leblon,A
3,5.555556e+10,Pedro,M,09-10-75,C,3.0,1500.0,1500.0,A,Centro,A
4,2.222222e+10,Mario,M,02-20-60,C,5.0,2500.0,1500.0,P,Leblon,A
...,...,...,...,...,...,...,...,...,...,...,...
291,1.867890e+10,Bruno,M,12-10-86,C,2.0,3200.0,1400.0,A,Vila Isabel,A
292,1.878901e+10,Laura,F,04-17-80,S,1.0,2000.0,900.0,X,Grajaú,I
293,1.889012e+10,Gustavo,M,08-21-90,C,3.0,4500.0,2500.0,F,Andaraí,A
294,1.890123e+10,Fernanda,F,06-03-75,V,4.0,5000.0,3000.0,P,Centro,A
295,1.901235e+10,Thiago,M,01-18-88,C,1.0,2800.0,1200.0,A,Leblon,A

In [149]:
#df_corrigido['Renda','Num_Dep','Despesa'] = df_corrigido['Renda','Num_Dep','Despesa'].fillna()
#df_corrigido['Renda'].mean()

In [150]:
df_corrigido['Renda'] = df_corrigido['Renda'].fillna(df_corrigido['Renda'].mean())

In [151]:
df_corrigido['Despesa'] = df_corrigido['Despesa'].fillna(df_corrigido['Despesa'].mean())

In [152]:
df_corrigido['Num_Dep'] = df_corrigido['Num_Dep'].fillna(0)

In [153]:
df_corrigido.loc[[0,5]]

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,05-05-89,C,1.0,4021.428571,1000.0,X,Centro,A
5,0.000000e+00,Manoel,M,10-13-54,S,1.0,4021.428571,1000.0,E,Barra,I

In [154]:
df_corrigido.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 296 entries, 0 to 295
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         296 non-null    float64
 1   Nome        296 non-null    object
 2   Sexo        296 non-null    object
 3   Data_Nasc   296 non-null    object
 4   Est_Civil   296 non-null    object
 5   Num_Dep     296 non-null    float64
 6   Renda       296 non-null    float64
 7   Despesa     296 non-null    float64
 8   Tp_Res      296 non-null    object
 9   Bairro_Res  296 non-null    object
 10  Result      296 non-null    object
dtypes: float64(4), object(7)
memory usage: 25.6+ KB

In [155]:
variaveis_categoricas = ['Cpf','Nome','Sexo','Est_Civil','Tp_Res','Bairro_Res','Result']
variaveis_continuas = ['Renda','Despesa']
variaveis_discretas = ['Num_Dep']

df_corrigido[variaveis_categoricas] = df_corrigido[variaveis_categoricas].astype('category')
df_corrigido[variaveis_continuas] = df_corrigido[variaveis_continuas].astype('float64')
df_corrigido[variaveis_discretas] = df_corrigido[variaveis_discretas].astype('int64')
df_corrigido['Data_Nasc'] = pd.to_datetime(df_corrigido['Data_Nasc'], format='%m-%d-%y')

In [156]:
df_corrigido.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 296 entries, 0 to 295
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         296 non-null    category
 1   Nome        296 non-null    category
 2   Sexo        296 non-null    category
 3   Data_Nasc   296 non-null    datetime64[ns]
 4   Est_Civil   296 non-null    category
 5   Num_Dep     296 non-null    int64
 6   Renda       296 non-null    float64
 7   Despesa     296 non-null    float64
 8   Tp_Res      296 non-null    category
 9   Bairro_Res  296 non-null    category
 10  Result      296 non-null    category
dtypes: category(7), datetime64[ns](1), float64(2), int64(1)
memory usage: 25.2 KB

In [157]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,José,M,1989-05-05,C,1,4021.428571,1000.0,X,Centro,A
1,1.111111e+10,Maria,F,1985-07-10,S,5,3000.000000,2000.0,P,Urca,A
2,3.333333e+10,Ana,F,1981-08-15,S,4,5000.000000,3000.0,P,Leblon,A
3,5.555556e+10,Pedro,M,1975-09-10,C,3,1500.000000,1500.0,A,Centro,A
4,2.222222e+10,Mario,M,2060-02-20,C,5,2500.000000,1500.0,P,Leblon,A
...,...,...,...,...,...,...,...,...,...,...,...
291,1.867890e+10,Bruno,M,1986-12-10,C,2,3200.000000,1400.0,A,Vila Isabel,A
292,1.878901e+10,Laura,F,1980-04-17,S,1,2000.000000,900.0,X,Grajaú,I
293,1.889012e+10,Gustavo,M,1990-08-21,C,3,4500.000000,2500.0,F,Andaraí,A
294,1.890123e+10,Fernanda,F,1975-06-03,V,4,5000.000000,3000.0,P,Centro,A
295,1.901235e+10,Thiago,M,1988-01-18,C,1,2800.000000,1200.0,A,Leblon,A

In [158]:
coluna_upper = ['Nome','Sexo','Est_Civil','Tp_Res','Bairro_Res','Result']

df_corrigido[coluna_upper] = df_corrigido[coluna_upper].apply(lambda x: x.str.upper())

In [159]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.000000e+11,JOSÉ,M,1989-05-05,C,1,4021.428571,1000.0,X,CENTRO,A
1,1.111111e+10,MARIA,F,1985-07-10,S,5,3000.000000,2000.0,P,URCA,A
2,3.333333e+10,ANA,F,1981-08-15,S,4,5000.000000,3000.0,P,LEBLON,A
3,5.555556e+10,PEDRO,M,1975-09-10,C,3,1500.000000,1500.0,A,CENTRO,A
4,2.222222e+10,MARIO,M,2060-02-20,C,5,2500.000000,1500.0,P,LEBLON,A
...,...,...,...,...,...,...,...,...,...,...,...
291,1.867890e+10,BRUNO,M,1986-12-10,C,2,3200.000000,1400.0,A,VILA ISABEL,A
292,1.878901e+10,LAURA,F,1980-04-17,S,1,2000.000000,900.0,X,GRAJAÚ,I
293,1.889012e+10,GUSTAVO,M,1990-08-21,C,3,4500.000000,2500.0,F,ANDARAÍ,A
294,1.890123e+10,FERNANDA,F,1975-06-03,V,4,5000.000000,3000.0,P,CENTRO,A
295,1.901235e+10,THIAGO,M,1988-01-18,C,1,2800.000000,1200.0,A,LEBLON,A

In [160]:
df_corrigido['Sexo'].value_counts()

Sexo
F    151
M    145
Name: count, dtype: int64

In [161]:
df_corrigido['Est_Civil'].value_counts()

Est_Civil
C    158
S     82
V     56
Name: count, dtype: int64

In [162]:
df_corrigido['Tp_Res'].value_counts()

Tp_Res
P    95
A    93
F    58
X    49
E     1
Name: count, dtype: int64

In [163]:
df_corrigido['Tp_Res'].isin(valores_validos)

0      False
1       True
2       True
3       True
4       True
       ...
291     True
292    False
293     True
294     True
295     True
Name: Tp_Res, Length: 296, dtype: bool

In [164]:
valores_validos = ['P','A','E','F','O']

df_corrigido = df_corrigido[df_corrigido['Tp_Res'].isin(valores_validos)]

In [165]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
1,1.111111e+10,MARIA,F,1985-07-10,S,5,3000.000000,2000.0,P,URCA,A
2,3.333333e+10,ANA,F,1981-08-15,S,4,5000.000000,3000.0,P,LEBLON,A
3,5.555556e+10,PEDRO,M,1975-09-10,C,3,1500.000000,1500.0,A,CENTRO,A
4,2.222222e+10,MARIO,M,2060-02-20,C,5,2500.000000,1500.0,P,LEBLON,A
5,0.000000e+00,MANOEL,M,2054-10-13,S,1,4021.428571,1000.0,E,BARRA,I
...,...,...,...,...,...,...,...,...,...,...,...
290,1.856789e+10,LARA,F,1973-09-05,V,5,7500.000000,5200.0,P,MARACANÃ,A
291,1.867890e+10,BRUNO,M,1986-12-10,C,2,3200.000000,1400.0,A,VILA ISABEL,A
293,1.889012e+10,GUSTAVO,M,1990-08-21,C,3,4500.000000,2500.0,F,ANDARAÍ,A
294,1.890123e+10,FERNANDA,F,1975-06-03,V,4,5000.000000,3000.0,P,CENTRO,A
295,1.901235e+10,THIAGO,M,1988-01-18,C,1,2800.000000,1200.0,A,LEBLON,A

In [166]:
df_corrigido.info()

<class 'pandas.core.frame.DataFrame'>
Index: 247 entries, 1 to 295
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         247 non-null    category
 1   Nome        247 non-null    object
 2   Sexo        247 non-null    object
 3   Data_Nasc   247 non-null    datetime64[ns]
 4   Est_Civil   247 non-null    object
 5   Num_Dep     247 non-null    int64
 6   Renda       247 non-null    float64
 7   Despesa     247 non-null    float64
 8   Tp_Res      247 non-null    object
 9   Bairro_Res  247 non-null    object
 10  Result      247 non-null    object
dtypes: category(1), datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 31.4+ KB

In [167]:
df_corrigido.info()

<class 'pandas.core.frame.DataFrame'>
Index: 247 entries, 1 to 295
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         247 non-null    category
 1   Nome        247 non-null    object
 2   Sexo        247 non-null    object
 3   Data_Nasc   247 non-null    datetime64[ns]
 4   Est_Civil   247 non-null    object
 5   Num_Dep     247 non-null    int64
 6   Renda       247 non-null    float64
 7   Despesa     247 non-null    float64
 8   Tp_Res      247 non-null    object
 9   Bairro_Res  247 non-null    object
 10  Result      247 non-null    object
dtypes: category(1), datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 31.4+ KB

In [168]:
df_corrigido.drop_duplicates(subset='Cpf', keep='first', inplace=True)

/tmp/ipykernel_41921/744613941.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_corrigido.drop_duplicates(subset='Cpf', keep='first', inplace=True)

In [169]:
df_corrigido.describe(include='object')

           Nome Sexo Est_Civil Tp_Res Bairro_Res Result
count       186  186       186    186        186    186
unique       57    2         3      4         21      2
top     RICARDO    M         C      P     LEBLON      A
freq          7   96       102     72         22    159

In [170]:
hoje = pd.to_datetime('today')
hoje

Timestamp('2025-10-10 21:59:34.221789')

In [171]:
df_corrigido = df_corrigido[df_corrigido['Data_Nasc'] < hoje]

In [172]:
df_corrigido.info()

<class 'pandas.core.frame.DataFrame'>
Index: 178 entries, 1 to 293
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cpf         178 non-null    category
 1   Nome        178 non-null    object
 2   Sexo        178 non-null    object
 3   Data_Nasc   178 non-null    datetime64[ns]
 4   Est_Civil   178 non-null    object
 5   Num_Dep     178 non-null    int64
 6   Renda       178 non-null    float64
 7   Despesa     178 non-null    float64
 8   Tp_Res      178 non-null    object
 9   Bairro_Res  178 non-null    object
 10  Result      178 non-null    object
dtypes: category(1), datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 25.3+ KB

In [173]:
df_corrigido.reset_index(drop=True, inplace=True)

In [174]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result
0,1.111111e+10,MARIA,F,1985-07-10,S,5,3000.0,2000.0,P,URCA,A
1,3.333333e+10,ANA,F,1981-08-15,S,4,5000.0,3000.0,P,LEBLON,A
2,5.555556e+10,PEDRO,M,1975-09-10,C,3,1500.0,1500.0,A,CENTRO,A
3,8.888889e+10,LIZA,F,1980-04-27,S,2,4500.0,3000.0,F,URCA,A
4,7.777778e+10,MARISA,F,1980-07-14,C,3,1000.0,500.0,A,RECREIO,I
...,...,...,...,...,...,...,...,...,...,...,...
173,1.834568e+10,PRISCILA,F,1983-02-14,C,3,4600.0,2700.0,A,GLÓRIA,A
174,1.845679e+10,RENATO,M,1991-11-26,C,0,1700.0,850.0,F,URCA,I
175,1.856789e+10,LARA,F,1973-09-05,V,5,7500.0,5200.0,P,MARACANÃ,A
176,1.867890e+10,BRUNO,M,1986-12-10,C,2,3200.0,1400.0,A,VILA ISABEL,A
177,1.889012e+10,GUSTAVO,M,1990-08-21,C,3,4500.0,2500.0,F,ANDARAÍ,A

In [177]:
df_corrigido['Idade'] = ((hoje - df_corrigido['Data_Nasc']).dt.days // 365).astype('int')

/tmp/ipykernel_41921/2799364885.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_corrigido['Idade'] = ((hoje - df_corrigido['Data_Nasc']).dt.days // 365).astype('int')

In [178]:
df_corrigido

,Cpf,Nome,Sexo,Data_Nasc,Est_Civil,Num_Dep,Renda,Despesa,Tp_Res,Bairro_Res,Result,Idade
0,1.111111e+10,MARIA,F,1985-07-10,S,5,3000.0,2000.0,P,URCA,A,40
1,3.333333e+10,ANA,F,1981-08-15,S,4,5000.0,3000.0,P,LEBLON,A,44
2,5.555556e+10,PEDRO,M,1975-09-10,C,3,1500.0,1500.0,A,CENTRO,A,50
3,8.888889e+10,LIZA,F,1980-04-27,S,2,4500.0,3000.0,F,URCA,A,45
4,7.777778e+10,MARISA,F,1980-07-14,C,3,1000.0,500.0,A,RECREIO,I,45
...,...,...,...,...,...,...,...,...,...,...,...,...
173,1.834568e+10,PRISCILA,F,1983-02-14,C,3,4600.0,2700.0,A,GLÓRIA,A,42
174,1.845679e+10,RENATO,M,1991-11-26,C,0,1700.0,850.0,F,URCA,I,33
175,1.856789e+10,LARA,F,1973-09-05,V,5,7500.0,5200.0,P,MARACANÃ,A,52
176,1.867890e+10,BRUNO,M,1986-12-10,C,2,3200.0,1400.0,A,VILA ISABEL,A,38
177,1.889012e+10,GUSTAVO,M,1990-08-21,C,3,4500.0,2500.0,F,ANDARAÍ,A,35

In [179]:
df_corrigido.columns

Index(['Cpf', 'Nome', 'Sexo', 'Data_Nasc', 'Est_Civil', 'Num_Dep', 'Renda',
       'Despesa', 'Tp_Res', 'Bairro_Res', 'Result', 'Idade'],
      dtype='object')

In [181]:
df_corrigido = df_corrigido[['Sexo', 'Est_Civil', 'Num_Dep', 'Renda','Despesa', 'Tp_Res', 'Bairro_Res', 'Result', 'Idade']]

In [182]:
df_corrigido

    Sexo Est_Civil  Num_Dep   Renda  Despesa Tp_Res   Bairro_Res Result  Idade
0      F         S        5  3000.0   2000.0      P         URCA      A     40
1      F         S        4  5000.0   3000.0      P       LEBLON      A     44
2      M         C        3  1500.0   1500.0      A       CENTRO      A     50
3      F         S        2  4500.0   3000.0      F         URCA      A     45
4      F         C        3  1000.0    500.0      A      RECREIO      I     45
..   ...       ...      ...     ...      ...    ...          ...    ...    ...
173    F         C        3  4600.0   2700.0      A       GLÓRIA      A     42
174    M         C        0  1700.0    850.0      F         URCA      I     33
175    F         V        5  7500.0   5200.0      P     MARACANÃ      A     52
176    M         C        2  3200.0   1400.0      A  VILA ISABEL      A     38
177    M         C        3  4500.0   2500.0      F      ANDARAÍ      A     35

[178 rows x 9 columns]